import java.io.BufferedReader;
import java.io.IOException;
import java.io.InputStreamReader;

/* Мама Мыла Раму. Теперь с большой буквы
Написать программу, которая вводит с клавиатуры строку текста.
Программа заменяет в тексте первые буквы всех слов на заглавные.
Пример ввода:
мама     мыла раму.
Пример вывода:
Мама     Мыла Раму.
*/

public class Solution
{
    public static void main(String[] args) throws IOException
    {
        BufferedReader reader = new BufferedReader(new InputStreamReader(System.in));
        String s = reader.readLine();

        char[]a = s.toCharArray();
        a[0]=Character.toUpperCase(a[0]);
        for (int i = 0; i < s.length(); i++){
            if (s.charAt(i) == ' '){
                a[i+1] = Character.toUpperCase(a[i + 1]);
            }
        }
        System.out.println(a);
    }
}
